GreatCowBASIC/DATFileGenerator/incfiles/OrgFiles/p18F26Q83.inc
        LIST
;==========================================================================
;
;  Built by Great Cow BASIC convertor
;  MPASM processor include for the chip shown below
;
; C:\Program Files\Microchip\MPLABX\v5.50\packs\index.idx
; C:\Program Files\Microchip\MPLABX\v5.50\packs\Microchip\PIC18F-Q_DFP\1.11.185\xc8\pic\dat\ini\18F26Q83.ini
; C:\Program Files\Microchip\MPLABX\v5.50\packs\Microchip\PIC18F-Q_DFP\1.11.185\edc\18F26Q83.PIC
; C:\Program Files\Microchip\MPLABX\v5.50\packs\Microchip\PIC18F-Q_DFP\1.11.185\xc8\pic\dat\cfgdata\18F26Q83.cfgdata
;
;==========================================================================
        NOLIST
        IFNDEF __PIC18F26Q83
           MESSG "Processor-header file mismatch.  Verify selected processor."
        ENDIF
;==========================================================================
;       18xxxx Family        EQUates
;==========================================================================
FSR0             EQU  0
FSR1             EQU  1
FSR2             EQU  2
FAST             EQU  1
W                EQU  0
A                EQU  0
ACCESS           EQU  0
BANKED           EQU  1
;==========================================================================
;
;       Register Definitions
;
;==========================================================================

;----- Register Files -----------------------------------------------------
BOOTREG          EQU  H'0038'
CLKRCON          EQU  H'0039'
CLKRCLK          EQU  H'003A'
NVMCON0          EQU  H'0040'
NVMCON1          EQU  H'0041'
NVMLOCK          EQU  H'0042'
NVMADR           EQU  H'0043'
NVMADRL          EQU  H'0043'
NVMADRH          EQU  H'0044'
NVMADRU          EQU  H'0045'
NVMDAT           EQU  H'0046'
NVMDATL          EQU  H'0046'
NVMDATH          EQU  H'0047'
VREGCON          EQU  H'0048'
BORCON           EQU  H'0049'
HLVDCON0         EQU  H'004A'
HLVDCON1         EQU  H'004B'
ZCDCON           EQU  H'004C'
PMD0             EQU  H'0060'
PMD1             EQU  H'0061'
PMD2             EQU  H'0062'
PMD3             EQU  H'0063'
PMD4             EQU  H'0064'
PMD5             EQU  H'0065'
PMD6             EQU  H'0066'
PMD7             EQU  H'0067'
PMD8             EQU  H'0068'
MD1CON0          EQU  H'006A'
MD1CON1          EQU  H'006B'
MD1SRC           EQU  H'006C'
MD1CARL          EQU  H'006D'
MD1CARH          EQU  H'006E'
CMOUT            EQU  H'006F'
CM1CON0          EQU  H'0070'
CM1CON1          EQU  H'0071'
CM1NCH           EQU  H'0072'
CM1PCH           EQU  H'0073'
CM2CON0          EQU  H'0074'
CM2CON1          EQU  H'0075'
CM2NCH           EQU  H'0076'
CM2PCH           EQU  H'0077'
WDTCON0          EQU  H'0078'
WDTCON1          EQU  H'0079'
WDTPSL           EQU  H'007A'
WDTPSH           EQU  H'007B'
WDTTMR           EQU  H'007C'
DAC1DAT          EQU  H'007D'
DAC1DATL         EQU  H'007D'
DAC1CON          EQU  H'007F'
SPI1RXB          EQU  H'0080'
SPI1TXB          EQU  H'0081'
SPI1TCNT         EQU  H'0082'
SPI1TCNTL        EQU  H'0082'
SPI1TCNTH        EQU  H'0083'
SPI1CON0         EQU  H'0084'
SPI1CON1         EQU  H'0085'
SPI1CON2         EQU  H'0086'
SPI1STATUS       EQU  H'0087'
SPI1TWIDTH       EQU  H'0088'
SPI1BAUD         EQU  H'0089'
SPI1INTF         EQU  H'008A'
SPI1INTE         EQU  H'008B'
SPI1CLK          EQU  H'008C'
SPI2RXB          EQU  H'008D'
SPI2TXB          EQU  H'008E'
SPI2TCNT         EQU  H'008F'
SPI2TCNTL        EQU  H'008F'
SPI2TCNTH        EQU  H'0090'
SPI2CON0         EQU  H'0091'
SPI2CON1         EQU  H'0092'
SPI2CON2         EQU  H'0093'
SPI2STATUS       EQU  H'0094'
SPI2TWIDTH       EQU  H'0095'
SPI2BAUD         EQU  H'0096'
SPI2INTF         EQU  H'0097'
SPI2INTE         EQU  H'0098'
SPI2CLK          EQU  H'0099'
ACTCON           EQU  H'00AC'
OSCCON1          EQU  H'00AD'
OSCCON2          EQU  H'00AE'
OSCCON3          EQU  H'00AF'
OSCTUNE          EQU  H'00B0'
OSCFRQ           EQU  H'00B1'
OSCFREQ          EQU  H'00B1'
OSCSTAT          EQU  H'00B2'
OSCSTAT1         EQU  H'00B2'
OSCEN            EQU  H'00B3'
PRLOCK           EQU  H'00B4'
SCANPR           EQU  H'00B5'
DMA1PR           EQU  H'00B6'
DMA2PR           EQU  H'00B7'
DMA3PR           EQU  H'00B8'
DMA4PR           EQU  H'00B9'
DMA5PR           EQU  H'00BA'
DMA6PR           EQU  H'00BB'
DMA7PR           EQU  H'00BC'
DMA8PR           EQU  H'00BD'
MAINPR           EQU  H'00BE'
ISRPR            EQU  H'00BF'
CLCDATA          EQU  H'00D4'
CLCSELECT        EQU  H'00D5'
CLCNCON          EQU  H'00D6'
CLCNPOL          EQU  H'00D7'
CLCNSEL0         EQU  H'00D8'
CLCNSEL1         EQU  H'00D9'
CLCNSEL2         EQU  H'00DA'
CLCNSEL3         EQU  H'00DB'
CLCNGLS0         EQU  H'00DC'
CLCNGLS1         EQU  H'00DD'
CLCNGLS2         EQU  H'00DE'
CLCNGLS3         EQU  H'00DF'
DMASELECT        EQU  H'00E8'
DMANBUF          EQU  H'00E9'
DMANDCNT         EQU  H'00EA'
DMANDCNTL        EQU  H'00EA'
DMANDCNTH        EQU  H'00EB'
DMANDPTR         EQU  H'00EC'
DMANDPTRL        EQU  H'00EC'
DMANDPTRH        EQU  H'00ED'
DMANDSZ          EQU  H'00EE'
DMANDSZL         EQU  H'00EE'
DMANDSZH         EQU  H'00EF'
DMANDSA          EQU  H'00F0'
DMANDSAL         EQU  H'00F0'
DMANDSAH         EQU  H'00F1'
DMANSCNT         EQU  H'00F2'
DMANSCNTL        EQU  H'00F2'
DMANSCNTH        EQU  H'00F3'
DMANSPTR         EQU  H'00F4'
DMANSPTRL        EQU  H'00F4'
DMANSPTRH        EQU  H'00F5'
DMANSPTRU        EQU  H'00F6'
DMANSSZ          EQU  H'00F7'
DMANSSZL         EQU  H'00F7'
DMANSSZH         EQU  H'00F8'
DMANSSA          EQU  H'00F9'
DMANSSAL         EQU  H'00F9'
DMANSSAH         EQU  H'00FA'
DMANSSAU         EQU  H'00FB'
DMANCON0         EQU  H'00FC'
DMANCON1         EQU  H'00FD'
DMANAIRQ         EQU  H'00FE'
DMANSIRQ         EQU  H'00FF'
C1CONL           EQU  H'0100'
C1CONH           EQU  H'0101'
C1CONU           EQU  H'0102'
C1CONT           EQU  H'0103'
C1NBTCFGL        EQU  H'0104'
C1NBTCFGH        EQU  H'0105'
C1NBTCFGU        EQU  H'0106'
C1NBTCFGT        EQU  H'0107'
C1DBTCFGL        EQU  H'0108'
C1DBTCFGH        EQU  H'0109'
C1DBTCFGU        EQU  H'010A'
C1DBTCFGT        EQU  H'010B'
C1TDCL           EQU  H'010C'
C1TDCH           EQU  H'010D'
C1TDCU           EQU  H'010E'
C1TBC            EQU  H'0110'
C1TBCL           EQU  H'0110'
C1TBCH           EQU  H'0111'
C1TBCU           EQU  H'0112'
C1TBCT           EQU  H'0113'
C1TSCONL         EQU  H'0114'
C1TSCONH         EQU  H'0115'
C1TSCONU         EQU  H'0116'
C1TSCONT         EQU  H'0117'
C1VECL           EQU  H'0118'
C1VECH           EQU  H'0119'
C1VECU           EQU  H'011A'
C1VECT           EQU  H'011B'
C1INTL           EQU  H'011C'
C1INTH           EQU  H'011D'
C1INTU           EQU  H'011E'
C1INTT           EQU  H'011F'
C1RXIF           EQU  H'0120'
C1RXIFL          EQU  H'0120'
C1RXIFH          EQU  H'0121'
C1RXIFU          EQU  H'0122'
C1RXIFT          EQU  H'0123'
C1TXIF           EQU  H'0124'
C1TXIFL          EQU  H'0124'
C1TXIFH          EQU  H'0125'
C1TXIFU          EQU  H'0126'
C1TXIFT          EQU  H'0127'
C1RXOVIF         EQU  H'0128'
C1RXOVIFL        EQU  H'0128'
C1RXOVIFH        EQU  H'0129'
C1RXOVIFU        EQU  H'012A'
C1RXOVIFT        EQU  H'012B'
C1TXATIF         EQU  H'012C'
C1TXATIFL        EQU  H'012C'
C1TXATIFH        EQU  H'012D'
C1TXATIFU        EQU  H'012E'
C1TXATIFT        EQU  H'012F'
C1TXREQ          EQU  H'0130'
C1TXREQL         EQU  H'0130'
C1TXREQH         EQU  H'0131'
C1TXREQU         EQU  H'0132'
C1TXREQT         EQU  H'0133'
C1TRECL          EQU  H'0134'
C1TRECH          EQU  H'0135'
C1TRECU          EQU  H'0136'
C1TRECT          EQU  H'0137'
C1BDIAG0L        EQU  H'0138'
C1BDIAG0H        EQU  H'0139'
C1BDIAG1L        EQU  H'013C'
C1BDIAG1H        EQU  H'013D'
C1BDIAG1U        EQU  H'013E'
C1BDIAG1T        EQU  H'013F'
C1TEFCONL        EQU  H'0140'
C1TEFCONH        EQU  H'0141'
C1TEFCONU        EQU  H'0142'
C1TEFCONT        EQU  H'0143'
C1TEFSTAL        EQU  H'0144'
C1TEFSTAH        EQU  H'0145'
C1TEFSTAU        EQU  H'0146'
C1TEFSTAT        EQU  H'0147'
C1TEFUA          EQU  H'0148'
C1TEFUAL         EQU  H'0148'
C1TEFUAH         EQU  H'0149'
C1TEFUAU         EQU  H'014A'
C1TEFUAT         EQU  H'014B'
C1FIFOBA         EQU  H'014C'
C1FIFOBAL        EQU  H'014C'
C1FIFOBAH        EQU  H'014D'
C1FIFOBAU        EQU  H'014E'
C1FIFOBAT        EQU  H'014F'
C1TXQCONL        EQU  H'0150'
C1TXQCONH        EQU  H'0151'
C1TXQCONU        EQU  H'0152'
C1TXQCONT        EQU  H'0153'
C1TXQSTAL        EQU  H'0154'
C1TXQSTAH        EQU  H'0155'
C1TXQSTAU        EQU  H'0156'
C1TXQSTAT        EQU  H'0157'
C1TXQUA          EQU  H'0158'
C1TXQUAL         EQU  H'0158'
C1TXQUAH         EQU  H'0159'
C1TXQUAU         EQU  H'015A'
C1TXQUAT         EQU  H'015B'
C1FIFOCON1       EQU  H'015C'
C1FIFOCON1L      EQU  H'015C'
C1FIFOCON1H      EQU  H'015D'
C1FIFOCON1U      EQU  H'015E'
C1FIFOCON1T      EQU  H'015F'
C1FIFOSTA1       EQU  H'0160'
C1FIFOSTA1L      EQU  H'0160'
C1FIFOSTA1H      EQU  H'0161'
C1FIFOSTA1U      EQU  H'0162'
C1FIFOSTA1T      EQU  H'0163'
C1FIFOUA1        EQU  H'0164'
C1FIFOUA1L       EQU  H'0164'
C1FIFOUA1H       EQU  H'0165'
C1FIFOUA1U       EQU  H'0166'
C1FIFOUA1T       EQU  H'0167'
C1FIFOCON2       EQU  H'0168'
C1FIFOCON2L      EQU  H'0168'
C1FIFOCON2H      EQU  H'0169'
C1FIFOCON2U      EQU  H'016A'
C1FIFOCON2T      EQU  H'016B'
C1FIFOSTA2       EQU  H'016C'
C1FIFOSTA2L      EQU  H'016C'
C1FIFOSTA2H      EQU  H'016D'
C1FIFOSTA2U      EQU  H'016E'
C1FIFOSTA2T      EQU  H'016F'
C1FIFOUA2        EQU  H'0170'
C1FIFOUA2L       EQU  H'0170'
C1FIFOUA2H       EQU  H'0171'
C1FIFOUA2U       EQU  H'0172'
C1FIFOUA2T       EQU  H'0173'
C1FIFOCON3       EQU  H'0174'
C1FIFOCON3L      EQU  H'0174'
C1FIFOCON3H      EQU  H'0175'
C1FIFOCON3U      EQU  H'0176'
C1FIFOCON3T      EQU  H'0177'
C1FIFOSTA3       EQU  H'0178'
C1FIFOSTA3L      EQU  H'0178'
C1FIFOSTA3H      EQU  H'0179'
C1FIFOSTA3U      EQU  H'017A'
C1FIFOSTA3T      EQU  H'017B'
C1FIFOUA3        EQU  H'017C'
C1FIFOUA3L       EQU  H'017C'
C1FIFOUA3H       EQU  H'017D'
C1FIFOUA3U       EQU  H'017E'
C1FIFOUA3T       EQU  H'017F'
C1FLTCON0L       EQU  H'0180'
C1FLTCON0H       EQU  H'0181'
C1FLTCON0U       EQU  H'0182'
C1FLTCON0T       EQU  H'0183'
C1FLTCON1L       EQU  H'0184'
C1FLTCON1H       EQU  H'0185'
C1FLTCON1U       EQU  H'0186'
C1FLTCON1T       EQU  H'0187'
C1FLTCON2L       EQU  H'0188'
C1FLTCON2H       EQU  H'0189'
C1FLTCON2U       EQU  H'018A'
C1FLTCON2T       EQU  H'018B'
C1FLTOBJ0        EQU  H'018C'
C1FLTOBJ0L       EQU  H'018C'
C1FLTOBJ0H       EQU  H'018D'
C1FLTOBJ0U       EQU  H'018E'
C1FLTOBJ0T       EQU  H'018F'
C1MASK0          EQU  H'0190'
C1MASK0L         EQU  H'0190'
C1MASK0H         EQU  H'0191'
C1MASK0U         EQU  H'0192'
C1MASK0T         EQU  H'0193'
C1FLTOBJ1        EQU  H'0194'
C1FLTOBJ1L       EQU  H'0194'
C1FLTOBJ1H       EQU  H'0195'
C1FLTOBJ1U       EQU  H'0196'
C1FLTOBJ1T       EQU  H'0197'
C1MASK1          EQU  H'0198'
C1MASK1L         EQU  H'0198'
C1MASK1H         EQU  H'0199'
C1MASK1U         EQU  H'019A'
C1MASK1T         EQU  H'019B'
C1FLTOBJ2        EQU  H'019C'
C1FLTOBJ2L       EQU  H'019C'
C1FLTOBJ2H       EQU  H'019D'
C1FLTOBJ2U       EQU  H'019E'
C1FLTOBJ2T       EQU  H'019F'
C1MASK2          EQU  H'01A0'
C1MASK2L         EQU  H'01A0'
C1MASK2H         EQU  H'01A1'
C1MASK2U         EQU  H'01A2'
C1MASK2T         EQU  H'01A3'
C1FLTOBJ3        EQU  H'01A4'
C1FLTOBJ3L       EQU  H'01A4'
C1FLTOBJ3H       EQU  H'01A5'
C1FLTOBJ3U       EQU  H'01A6'
C1FLTOBJ3T       EQU  H'01A7'
C1MASK3          EQU  H'01A8'
C1MASK3L         EQU  H'01A8'
C1MASK3H         EQU  H'01A9'
C1MASK3U         EQU  H'01AA'
C1MASK3T         EQU  H'01AB'
C1FLTOBJ4        EQU  H'01AC'
C1FLTOBJ4L       EQU  H'01AC'
C1FLTOBJ4H       EQU  H'01AD'
C1FLTOBJ4U       EQU  H'01AE'
C1FLTOBJ4T       EQU  H'01AF'
C1MASK4          EQU  H'01B0'
C1MASK4L         EQU  H'01B0'
C1MASK4H         EQU  H'01B1'
C1MASK4U         EQU  H'01B2'
C1MASK4T         EQU  H'01B3'
C1FLTOBJ5        EQU  H'01B4'
C1FLTOBJ5L       EQU  H'01B4'
C1FLTOBJ5H       EQU  H'01B5'
C1FLTOBJ5U       EQU  H'01B6'
C1FLTOBJ5T       EQU  H'01B7'
C1MASK5          EQU  H'01B8'
C1MASK5L         EQU  H'01B8'
C1MASK5H         EQU  H'01B9'
C1MASK5U         EQU  H'01BA'
C1MASK5T         EQU  H'01BB'
C1FLTOBJ6        EQU  H'01BC'
C1FLTOBJ6L       EQU  H'01BC'
C1FLTOBJ6H       EQU  H'01BD'
C1FLTOBJ6U       EQU  H'01BE'
C1FLTOBJ6T       EQU  H'01BF'
C1MASK6          EQU  H'01C0'
C1MASK6L         EQU  H'01C0'
C1MASK6H         EQU  H'01C1'
C1MASK6U         EQU  H'01C2'
C1MASK6T         EQU  H'01C3'
C1FLTOBJ7        EQU  H'01C4'
C1FLTOBJ7L       EQU  H'01C4'
C1FLTOBJ7H       EQU  H'01C5'
C1FLTOBJ7U       EQU  H'01C6'
C1FLTOBJ7T       EQU  H'01C7'
C1MASK7          EQU  H'01C8'
C1MASK7L         EQU  H'01C8'
C1MASK7H         EQU  H'01C9'
C1MASK7U         EQU  H'01CA'
C1MASK7T         EQU  H'01CB'
C1FLTOBJ8        EQU  H'01CC'
C1FLTOBJ8L       EQU  H'01CC'
C1FLTOBJ8H       EQU  H'01CD'
C1FLTOBJ8U       EQU  H'01CE'
C1FLTOBJ8T       EQU  H'01CF'
C1MASK8          EQU  H'01D0'
C1MASK8L         EQU  H'01D0'
C1MASK8H         EQU  H'01D1'
C1MASK8U         EQU  H'01D2'
C1MASK8T         EQU  H'01D3'
C1FLTOBJ9        EQU  H'01D4'
C1FLTOBJ9L       EQU  H'01D4'
C1FLTOBJ9H       EQU  H'01D5'
C1FLTOBJ9U       EQU  H'01D6'
C1FLTOBJ9T       EQU  H'01D7'
C1MASK9          EQU  H'01D8'
C1MASK9L         EQU  H'01D8'
C1MASK9H         EQU  H'01D9'
C1MASK9U         EQU  H'01DA'
C1MASK9T         EQU  H'01DB'
C1FLTOBJ10       EQU  H'01DC'
C1FLTOBJ10L      EQU  H'01DC'
C1FLTOBJ10H      EQU  H'01DD'
C1FLTOBJ10U      EQU  H'01DE'
C1FLTOBJ10T      EQU  H'01DF'
C1MASK10         EQU  H'01E0'
C1MASK10L        EQU  H'01E0'
C1MASK10H        EQU  H'01E1'
C1MASK10U        EQU  H'01E2'
C1MASK10T        EQU  H'01E3'
C1FLTOBJ11       EQU  H'01E4'
C1FLTOBJ11L      EQU  H'01E4'
C1FLTOBJ11H      EQU  H'01E5'
C1FLTOBJ11U      EQU  H'01E6'
C1FLTOBJ11T      EQU  H'01E7'
C1MASK11         EQU  H'01E8'
C1MASK11L        EQU  H'01E8'
C1MASK11H        EQU  H'01E9'
C1MASK11U        EQU  H'01EA'
C1MASK11T        EQU  H'01EB'
PPSLOCK          EQU  H'0200'
RA0PPS           EQU  H'0201'
RA1PPS           EQU  H'0202'
RA2PPS           EQU  H'0203'
RA3PPS           EQU  H'0204'
RA4PPS           EQU  H'0205'
RA5PPS           EQU  H'0206'
RA6PPS           EQU  H'0207'
RA7PPS           EQU  H'0208'
RB0PPS           EQU  H'0209'
RB1PPS           EQU  H'020A'
RB2PPS           EQU  H'020B'
RB3PPS           EQU  H'020C'
RB4PPS           EQU  H'020D'
RB5PPS           EQU  H'020E'
RB6PPS           EQU  H'020F'
RB7PPS           EQU  H'0210'
RC0PPS           EQU  H'0211'
RC1PPS           EQU  H'0212'
RC2PPS           EQU  H'0213'
RC3PPS           EQU  H'0214'
RC4PPS           EQU  H'0215'
RC5PPS           EQU  H'0216'
RC6PPS           EQU  H'0217'
RC7PPS           EQU  H'0218'
CANRXPPS         EQU  H'023D'
INT0PPS          EQU  H'023E'
INT1PPS          EQU  H'023F'
INT2PPS          EQU  H'0240'
T0CKIPPS         EQU  H'0241'
T1CKIPPS         EQU  H'0242'
T1GPPS           EQU  H'0243'
T3CKIPPS         EQU  H'0244'
T3GPPS           EQU  H'0245'
T5CKIPPS         EQU  H'0246'
T5GPPS           EQU  H'0247'
T2INPPS          EQU  H'0248'
T4INPPS          EQU  H'0249'
T6INPPS          EQU  H'024A'
TUIN0PPS         EQU  H'024B'
TUIN1PPS         EQU  H'024C'
TUIN2PPS         EQU  H'024D'
TUIN3PPS         EQU  H'024E'
CCP1PPS          EQU  H'024F'
CCP2PPS          EQU  H'0250'
CCP3PPS          EQU  H'0251'
PWM1ERSPPS       EQU  H'0253'
PWM2ERSPPS       EQU  H'0254'
PWM3ERSPPS       EQU  H'0255'
PWM4ERSPPS       EQU  H'0256'
PWMIN0PPS        EQU  H'0257'
PWMIN1PPS        EQU  H'0258'
SMT1WINPPS       EQU  H'0259'
SMT1SIGPPS       EQU  H'025A'
CWG1PPS          EQU  H'025B'
CWG1INPPS        EQU  H'025B'
CWG2PPS          EQU  H'025C'
CWG2INPPS        EQU  H'025C'
CWG3PPS          EQU  H'025D'
CWG3INPPS        EQU  H'025D'
MD1CARLPPS       EQU  H'025E'
MDCARLPPS        EQU  H'025E'
MD1CARHPPS       EQU  H'025F'
MDCARHPPS        EQU  H'025F'
MD1SRCPPS        EQU  H'0260'
MDSRCPPS         EQU  H'0260'
CLCIN0PPS        EQU  H'0261'
CLCIN1PPS        EQU  H'0262'
CLCIN2PPS        EQU  H'0263'
CLCIN3PPS        EQU  H'0264'
CLCIN4PPS        EQU  H'0265'
CLCIN5PPS        EQU  H'0266'
CLCIN6PPS        EQU  H'0267'
CLCIN7PPS        EQU  H'0268'
ADACTPPS         EQU  H'0269'
SPI1SCKPPS       EQU  H'026A'
SPI1SDIPPS       EQU  H'026B'
SPI1SSPPS        EQU  H'026C'
SPI2SCKPPS       EQU  H'026D'
SPI2SDIPPS       EQU  H'026E'
SPI2SSPPS        EQU  H'026F'
I2C1SDAPPS       EQU  H'0270'
I2C1SCLPPS       EQU  H'0271'
U1RXPPS          EQU  H'0272'
U1CTSPPS         EQU  H'0273'
U2RXPPS          EQU  H'0274'
U2CTSPPS         EQU  H'0275'
U3RXPPS          EQU  H'0276'
U3CTSPPS         EQU  H'0277'
U4RXPPS          EQU  H'0278'
U4CTSPPS         EQU  H'0279'
U5RXPPS          EQU  H'027A'
U5CTSPPS         EQU  H'027B'
RC4I2C           EQU  H'0286'
RC3I2C           EQU  H'0287'
RB2I2C           EQU  H'0288'
RB1I2C           EQU  H'0289'
I2C1RXB          EQU  H'028A'
I2C1TXB          EQU  H'028B'
I2C1CNTL         EQU  H'028C'
I2C1CNTH         EQU  H'028D'
I2C1ADB0         EQU  H'028E'
I2C1ADB1         EQU  H'028F'
I2C1ADR0         EQU  H'0290'
I2C1ADR1         EQU  H'0291'
I2C1ADR2         EQU  H'0292'
I2C1ADR3         EQU  H'0293'
I2C1CON0         EQU  H'0294'
I2C1CON1         EQU  H'0295'
I2C1CON2         EQU  H'0296'
I2C1ERR          EQU  H'0297'
I2C1STAT0        EQU  H'0298'
I2C1STAT1        EQU  H'0299'
I2C1PIR          EQU  H'029A'
I2C1PIE          EQU  H'029B'
I2C1BTO          EQU  H'029C'
I2C1BAUD         EQU  H'029D'
I2C1CLK          EQU  H'029E'
I2C1BTOC         EQU  H'029F'
U1RXB            EQU  H'02A1'
U1RXBL           EQU  H'02A1'
U1RXCHK          EQU  H'02A2'
U1TXB            EQU  H'02A3'
U1TXBL           EQU  H'02A3'
U1TXCHK          EQU  H'02A4'
U1P1             EQU  H'02A5'
U1P1L            EQU  H'02A5'
U1P1H            EQU  H'02A6'
U1P2             EQU  H'02A7'
U1P2L            EQU  H'02A7'
U1P2H            EQU  H'02A8'
U1P3             EQU  H'02A9'
U1P3L            EQU  H'02A9'
U1P3H            EQU  H'02AA'
U1CON0           EQU  H'02AB'
U1CON1           EQU  H'02AC'
U1CON2           EQU  H'02AD'
U1BRG            EQU  H'02AE'
U1BRGL           EQU  H'02AE'
U1BRGH           EQU  H'02AF'
U1FIFO           EQU  H'02B0'
U1UIR            EQU  H'02B1'
U1ERRIR          EQU  H'02B2'
U1ERRIE          EQU  H'02B3'
U2RXB            EQU  H'02B4'
U2RXBL           EQU  H'02B4'
U2RXCHK          EQU  H'02B5'
U2TXB            EQU  H'02B6'
U2TXBL           EQU  H'02B6'
U2TXCHK          EQU  H'02B7'
U2P1             EQU  H'02B8'
U2P1L            EQU  H'02B8'
U2P1H            EQU  H'02B9'
U2P2             EQU  H'02BA'
U2P2L            EQU  H'02BA'
U2P2H            EQU  H'02BB'
U2P3             EQU  H'02BC'
U2P3L            EQU  H'02BC'
U2P3H            EQU  H'02BD'
U2CON0           EQU  H'02BE'
U2CON1           EQU  H'02BF'
U2CON2           EQU  H'02C0'
U2BRG            EQU  H'02C1'
U2BRGL           EQU  H'02C1'
U2BRGH           EQU  H'02C2'
U2FIFO           EQU  H'02C3'
U2UIR            EQU  H'02C4'
U2ERRIR          EQU  H'02C5'
U2ERRIE          EQU  H'02C6'
U3RXB            EQU  H'02C7'
U3RXBL           EQU  H'02C7'
U3TXB            EQU  H'02C9'
U3TXBL           EQU  H'02C9'
U3P1             EQU  H'02CB'
U3P1L            EQU  H'02CB'
U3P2             EQU  H'02CD'
U3P2L            EQU  H'02CD'
U3P3             EQU  H'02CF'
U3P3L            EQU  H'02CF'
U3CON0           EQU  H'02D1'
U3CON1           EQU  H'02D2'
U3CON2           EQU  H'02D3'
U3BRG            EQU  H'02D4'
U3BRGL           EQU  H'02D4'
U3BRGH           EQU  H'02D5'
U3FIFO           EQU  H'02D6'
U3UIR            EQU  H'02D7'
U3ERRIR          EQU  H'02D8'
U3ERRIE          EQU  H'02D9'
U4RXB            EQU  H'02DA'
U4RXBL           EQU  H'02DA'
U4TXB            EQU  H'02DC'
U4TXBL           EQU  H'02DC'
U4P1             EQU  H'02DE'
U4P1L            EQU  H'02DE'
U4P2             EQU  H'02E0'
U4P2L            EQU  H'02E0'
U4P3             EQU  H'02E2'
U4P3L            EQU  H'02E2'
U4CON0           EQU  H'02E4'
U4CON1           EQU  H'02E5'
U4CON2           EQU  H'02E6'
U4BRG            EQU  H'02E7'
U4BRGL           EQU  H'02E7'
U4BRGH           EQU  H'02E8'
U4FIFO           EQU  H'02E9'
U4UIR            EQU  H'02EA'
U4ERRIR          EQU  H'02EB'
U4ERRIE          EQU  H'02EC'
U5RXB            EQU  H'02ED'
U5RXBL           EQU  H'02ED'
U5TXB            EQU  H'02EF'
U5TXBL           EQU  H'02EF'
U5P1             EQU  H'02F1'
U5P1L            EQU  H'02F1'
U5P2             EQU  H'02F3'
U5P2L            EQU  H'02F3'
U5P3             EQU  H'02F5'
U5P3L            EQU  H'02F5'
U5CON0           EQU  H'02F7'
U5CON1           EQU  H'02F8'
U5CON2           EQU  H'02F9'
U5BRG            EQU  H'02FA'
U5BRGL           EQU  H'02FA'
U5BRGH           EQU  H'02FB'
U5FIFO           EQU  H'02FC'
U5UIR            EQU  H'02FD'
U5ERRIR          EQU  H'02FE'
U5ERRIE          EQU  H'02FF'
SMT1TMR          EQU  H'0300'
SMT1TMRL         EQU  H'0300'
SMT1TMRH         EQU  H'0301'
SMT1TMRU         EQU  H'0302'
SMT1CPR          EQU  H'0303'
SMT1CPRL         EQU  H'0303'
SMT1CPRH         EQU  H'0304'
SMT1CPRU         EQU  H'0305'
SMT1CPW          EQU  H'0306'
SMT1CPWL         EQU  H'0306'
SMT1CPWH         EQU  H'0307'
SMT1CPWU         EQU  H'0308'
SMT1PR           EQU  H'0309'
SMT1PRL          EQU  H'0309'
SMT1PRH          EQU  H'030A'
SMT1PRU          EQU  H'030B'
SMT1CON0         EQU  H'030C'
SMT1CON1         EQU  H'030D'
SMT1STAT         EQU  H'030E'
SMT1CLK          EQU  H'030F'
SMT1SIG          EQU  H'0310'
SMT1WIN          EQU  H'0311'
TMR0L            EQU  H'0318'
TMR0             EQU  H'0318'
TMR0H            EQU  H'0319'
PR0              EQU  H'0319'
T0CON0           EQU  H'031A'
T0CON1           EQU  H'031B'
TMR1L            EQU  H'031C'
TMR1H            EQU  H'031D'
T1CON            EQU  H'031E'
TMR1CON          EQU  H'031E'
T1GCON           EQU  H'031F'
TMR1GCON         EQU  H'031F'
T1GATE           EQU  H'0320'
TMR1GATE         EQU  H'0320'
T1CLK            EQU  H'0321'
TMR1CLK          EQU  H'0321'
T2TMR            EQU  H'0322'
TMR2             EQU  H'0322'
T2PR             EQU  H'0323'
PR2              EQU  H'0323'
T2CON            EQU  H'0324'
T2HLT            EQU  H'0325'
T2CLKCON         EQU  H'0326'
T2CLK            EQU  H'0326'
T2RST            EQU  H'0327'
TMR3L            EQU  H'0328'
TMR3H            EQU  H'0329'
T3CON            EQU  H'032A'
TMR3CON          EQU  H'032A'
T3GCON           EQU  H'032B'
TMR3GCON         EQU  H'032B'
T3GATE           EQU  H'032C'
TMR3GATE         EQU  H'032C'
T3CLK            EQU  H'032D'
TMR3CLK          EQU  H'032D'
T4TMR            EQU  H'032E'
TMR4             EQU  H'032E'
T4PR             EQU  H'032F'
PR4              EQU  H'032F'
T4CON            EQU  H'0330'
T4HLT            EQU  H'0331'
T4CLKCON         EQU  H'0332'
T4CLK            EQU  H'0332'
T4RST            EQU  H'0333'
TMR5L            EQU  H'0334'
TMR5H            EQU  H'0335'
T5CON            EQU  H'0336'
TMR5CON          EQU  H'0336'
T5GCON           EQU  H'0337'
TMR5GCON         EQU  H'0337'
T5GATE           EQU  H'0338'
TMR5GATE         EQU  H'0338'
T5CLK            EQU  H'0339'
TMR5CLK          EQU  H'0339'
T6TMR            EQU  H'033A'
TMR6             EQU  H'033A'
T6PR             EQU  H'033B'
PR6              EQU  H'033B'
