GreatCowBASIC/DATFileGenerator/incfiles/OrgFiles/p18F26Q83.inc
;----- C1FIFOUA3H Bits -----------------------------------------------------
FIFOUA8          EQU  H'0000'
FIFOUA9          EQU  H'0001'
FIFOUA10         EQU  H'0002'
FIFOUA11         EQU  H'0003'
FIFOUA12         EQU  H'0004'
FIFOUA13         EQU  H'0005'
FIFOUA14         EQU  H'0006'
FIFOUA15         EQU  H'0007'


;----- C1FIFOUA3U Bits -----------------------------------------------------
FIFOUA16         EQU  H'0000'
FIFOUA17         EQU  H'0001'
FIFOUA18         EQU  H'0002'
FIFOUA19         EQU  H'0003'
FIFOUA20         EQU  H'0004'
FIFOUA21         EQU  H'0005'
FIFOUA22         EQU  H'0006'
FIFOUA23         EQU  H'0007'


;----- C1FIFOUA3T Bits -----------------------------------------------------
FIFOUA24         EQU  H'0000'
FIFOUA25         EQU  H'0001'
FIFOUA26         EQU  H'0002'
FIFOUA27         EQU  H'0003'
FIFOUA28         EQU  H'0004'
FIFOUA29         EQU  H'0005'
FIFOUA30         EQU  H'0006'
FIFOUA31         EQU  H'0007'


;----- C1FLTCON0L Bits -----------------------------------------------------
FLTEN0           EQU  H'0007'
F0BP0            EQU  H'0000'
F0BP1            EQU  H'0001'
F0BP2            EQU  H'0002'
F0BP3            EQU  H'0003'
F0BP4            EQU  H'0004'


;----- C1FLTCON0H Bits -----------------------------------------------------
FLTEN1           EQU  H'0007'
F1BP0            EQU  H'0000'
F1BP1            EQU  H'0001'
F1BP2            EQU  H'0002'
F1BP3            EQU  H'0003'
F1BP4            EQU  H'0004'


;----- C1FLTCON0U Bits -----------------------------------------------------
FLTEN2           EQU  H'0007'
F2BP0            EQU  H'0000'
F2BP1            EQU  H'0001'
F2BP2            EQU  H'0002'
F2BP3            EQU  H'0003'
F2BP4            EQU  H'0004'


;----- C1FLTCON0T Bits -----------------------------------------------------
FLTEN3           EQU  H'0007'
F3BP0            EQU  H'0000'
F3BP1            EQU  H'0001'
F3BP2            EQU  H'0002'
F3BP3            EQU  H'0003'
F3BP4            EQU  H'0004'


;----- C1FLTCON1L Bits -----------------------------------------------------
FLTEN4           EQU  H'0007'
F4BP0            EQU  H'0000'
F4BP1            EQU  H'0001'
F4BP2            EQU  H'0002'
F4BP3            EQU  H'0003'
F4BP4            EQU  H'0004'


;----- C1FLTCON1H Bits -----------------------------------------------------
FLTEN5           EQU  H'0007'
F5BP0            EQU  H'0000'
F5BP1            EQU  H'0001'
F5BP2            EQU  H'0002'
F5BP3            EQU  H'0003'
F5BP4            EQU  H'0004'


;----- C1FLTCON1U Bits -----------------------------------------------------
FLTEN6           EQU  H'0007'
F6BP0            EQU  H'0000'
F6BP1            EQU  H'0001'
F6BP2            EQU  H'0002'
F6BP3            EQU  H'0003'
F6BP4            EQU  H'0004'


;----- C1FLTCON1T Bits -----------------------------------------------------
FLTEN7           EQU  H'0007'
F7BP0            EQU  H'0000'
F7BP1            EQU  H'0001'
F7BP2            EQU  H'0002'
F7BP3            EQU  H'0003'
F7BP4            EQU  H'0004'


;----- C1FLTCON2L Bits -----------------------------------------------------
FLTEN8           EQU  H'0007'
F8BP0            EQU  H'0000'
F8BP1            EQU  H'0001'
F8BP2            EQU  H'0002'
F8BP3            EQU  H'0003'
F8BP4            EQU  H'0004'


;----- C1FLTCON2H Bits -----------------------------------------------------
FLTEN9           EQU  H'0007'
F9BP0            EQU  H'0000'
F9BP1            EQU  H'0001'
F9BP2            EQU  H'0002'
F9BP3            EQU  H'0003'
F9BP4            EQU  H'0004'


;----- C1FLTCON2U Bits -----------------------------------------------------
FLTEN10          EQU  H'0007'
F10BP0           EQU  H'0000'
F10BP1           EQU  H'0001'
F10BP2           EQU  H'0002'
F10BP3           EQU  H'0003'
F10BP4           EQU  H'0004'


;----- C1FLTCON2T Bits -----------------------------------------------------
FLTEN11          EQU  H'0007'
F11BP0           EQU  H'0000'
F11BP1           EQU  H'0001'
F11BP2           EQU  H'0002'
F11BP3           EQU  H'0003'
F11BP4           EQU  H'0004'


;----- C1FLTOBJ0 Bits -----------------------------------------------------
SID0             EQU  H'0000'
SID1             EQU  H'0001'
SID2             EQU  H'0002'
SID3             EQU  H'0003'
SID4             EQU  H'0004'
SID5             EQU  H'0005'
SID6             EQU  H'0006'
SID7             EQU  H'0007'


;----- C1FLTOBJ0H Bits -----------------------------------------------------
SID8             EQU  H'0000'
SID9             EQU  H'0001'
SID10            EQU  H'0002'
EID0             EQU  H'0003'
EID1             EQU  H'0004'
EID2             EQU  H'0005'
EID3             EQU  H'0006'
EID4             EQU  H'0007'


;----- C1FLTOBJ0U Bits -----------------------------------------------------
EID5             EQU  H'0000'
EID6             EQU  H'0001'
EID7             EQU  H'0002'
EID8             EQU  H'0003'
EID9             EQU  H'0004'
EID10            EQU  H'0005'
EID11            EQU  H'0006'
EID12            EQU  H'0007'


;----- C1FLTOBJ0T Bits -----------------------------------------------------
SID11            EQU  H'0005'
EXIDE            EQU  H'0006'
EID13            EQU  H'0000'
EID14            EQU  H'0001'
EID15            EQU  H'0002'
EID16            EQU  H'0003'
EID17            EQU  H'0004'


;----- C1MASK0 Bits -----------------------------------------------------
MSID0            EQU  H'0000'
MSID1            EQU  H'0001'
MSID2            EQU  H'0002'
MSID3            EQU  H'0003'
MSID4            EQU  H'0004'
MSID5            EQU  H'0005'
MSID6            EQU  H'0006'
MSID7            EQU  H'0007'


;----- C1MASK0H Bits -----------------------------------------------------
MSID8            EQU  H'0000'
MSID9            EQU  H'0001'
MSID10           EQU  H'0002'
MEID0            EQU  H'0003'
MEID1            EQU  H'0004'
MEID2            EQU  H'0005'
MEID3            EQU  H'0006'
MEID4            EQU  H'0007'


;----- C1MASK0U Bits -----------------------------------------------------
MEID5            EQU  H'0000'
MEID6            EQU  H'0001'
MEID7            EQU  H'0002'
MEID8            EQU  H'0003'
MEID9            EQU  H'0004'
MEID10           EQU  H'0005'
MEID11           EQU  H'0006'
MEID12           EQU  H'0007'


;----- C1MASK0T Bits -----------------------------------------------------
MSID11           EQU  H'0005'
MIDE             EQU  H'0006'
MEID13           EQU  H'0000'
MEID14           EQU  H'0001'
MEID15           EQU  H'0002'
MEID16           EQU  H'0003'
MEID17           EQU  H'0004'


;----- C1FLTOBJ1 Bits -----------------------------------------------------
SID0             EQU  H'0000'
SID1             EQU  H'0001'
SID2             EQU  H'0002'
SID3             EQU  H'0003'
SID4             EQU  H'0004'
SID5             EQU  H'0005'
SID6             EQU  H'0006'
SID7             EQU  H'0007'


