GreatCowBASIC/DATFileGenerator/incfiles/OrgFiles/p18F26Q83.inc
;----- PIE14 Bits -----------------------------------------------------
CLC7IE           EQU  H'0001'
C2IE             EQU  H'0002'
NCO3IE           EQU  H'0003'
DMA7SCNTIE       EQU  H'0004'
DMA7DCNTIE       EQU  H'0005'
DMA7ORIE         EQU  H'0006'
DMA7AIE          EQU  H'0007'


;----- PIE15 Bits -----------------------------------------------------
NVMIE            EQU  H'0000'
CLC8IE           EQU  H'0001'
CRCIE            EQU  H'0002'
TMR6IE           EQU  H'0003'
DMA8SCNTIE       EQU  H'0004'
DMA8DCNTIE       EQU  H'0005'
DMA8ORIE         EQU  H'0006'
DMA8AIE          EQU  H'0007'


;----- PIR0 Bits -----------------------------------------------------
SWIF             EQU  H'0000'
HLVDIF           EQU  H'0001'
OSFIF            EQU  H'0002'
CSWIF            EQU  H'0003'
TU16AIF          EQU  H'0004'
CLC1IF           EQU  H'0005'
CANIF            EQU  H'0006'
IOCIF            EQU  H'0007'


;----- PIR1 Bits -----------------------------------------------------
INT0IF           EQU  H'0000'
ZCDIF            EQU  H'0001'
ADIF             EQU  H'0002'
ACTIF            EQU  H'0003'
C1IF             EQU  H'0004'
SMT1IF           EQU  H'0005'
SMT1PRAIF        EQU  H'0006'
SMT1PWAIF        EQU  H'0007'


;----- PIR2 Bits -----------------------------------------------------
ADTIF            EQU  H'0000'
ADCH2IF          EQU  H'0001'
ADCH3IF          EQU  H'0002'
ADCH4IF          EQU  H'0003'
DMA1SCNTIF       EQU  H'0004'
DMA1DCNTIF       EQU  H'0005'
DMA1ORIF         EQU  H'0006'
DMA1AIF          EQU  H'0007'
ADCH1IF          EQU  H'0000'


;----- PIR3 Bits -----------------------------------------------------
SPI1RXIF         EQU  H'0000'
SPI1TXIF         EQU  H'0001'
SPI1IF           EQU  H'0002'
TMR2IF           EQU  H'0003'
TMR1IF           EQU  H'0004'
TMR1GIF          EQU  H'0005'
CCP1IF           EQU  H'0006'
TMR0IF           EQU  H'0007'


;----- PIR4 Bits -----------------------------------------------------
U1RXIF           EQU  H'0000'
U1TXIF           EQU  H'0001'
U1EIF            EQU  H'0002'
U1IF             EQU  H'0003'
CANRXIF          EQU  H'0004'
CANTXIF          EQU  H'0005'
PWM1PIF          EQU  H'0006'
PWM1IF           EQU  H'0007'


;----- PIR5 Bits -----------------------------------------------------
SPI2RXIF         EQU  H'0000'
SPI2TXIF         EQU  H'0001'
SPI2IF           EQU  H'0002'
TU16BIF          EQU  H'0003'
TMR3IF           EQU  H'0004'
TMR3GIF          EQU  H'0005'
PWM2PIF          EQU  H'0006'
PWM2IF           EQU  H'0007'


;----- PIR6 Bits -----------------------------------------------------
INT1IF           EQU  H'0000'
CLC2IF           EQU  H'0001'
CWG1IF           EQU  H'0002'
NCO1IF           EQU  H'0003'
DMA2SCNTIF       EQU  H'0004'
DMA2DCNTIF       EQU  H'0005'
DMA2ORIF         EQU  H'0006'
DMA2AIF          EQU  H'0007'


;----- PIR7 Bits -----------------------------------------------------
I2C1RXIF         EQU  H'0000'
I2C1TXIF         EQU  H'0001'
I2C1IF           EQU  H'0002'
I2C1EIF          EQU  H'0003'
CLC3IF           EQU  H'0005'
PWM3PIF          EQU  H'0006'
PWM3IF           EQU  H'0007'


;----- PIR8 Bits -----------------------------------------------------
U2RXIF           EQU  H'0000'
U2TXIF           EQU  H'0001'
U2EIF            EQU  H'0002'
U2IF             EQU  H'0003'
TMR5IF           EQU  H'0004'
TMR5GIF          EQU  H'0005'
CCP2IF           EQU  H'0006'
SCANIF           EQU  H'0007'


;----- PIR9 Bits -----------------------------------------------------
U3RXIF           EQU  H'0000'
U3TXIF           EQU  H'0001'
U3EIF            EQU  H'0002'
U3IF             EQU  H'0003'
CLC4IF           EQU  H'0005'
PWM4PIF          EQU  H'0006'
PWM4IF           EQU  H'0007'


;----- PIR10 Bits -----------------------------------------------------
INT2IF           EQU  H'0000'
CLC5IF           EQU  H'0001'
CWG2IF           EQU  H'0002'
NCO2IF           EQU  H'0003'
DMA3SCNTIF       EQU  H'0004'
DMA3DCNTIF       EQU  H'0005'
DMA3ORIF         EQU  H'0006'
DMA3AIF          EQU  H'0007'


;----- PIR11 Bits -----------------------------------------------------
CCP3IF           EQU  H'0000'
CLC6IF           EQU  H'0001'
CWG3IF           EQU  H'0002'
TMR4IF           EQU  H'0003'
DMA4SCNTIF       EQU  H'0004'
DMA4DCNTIF       EQU  H'0005'
DMA4ORIF         EQU  H'0006'
DMA4AIF          EQU  H'0007'


;----- PIR12 Bits -----------------------------------------------------
U4RXIF           EQU  H'0000'
U4TXIF           EQU  H'0001'
U4EIF            EQU  H'0002'
U4IF             EQU  H'0003'
DMA5SCNTIF       EQU  H'0004'
DMA5DCNTIF       EQU  H'0005'
DMA5ORIF         EQU  H'0006'
DMA5AIF          EQU  H'0007'


;----- PIR13 Bits -----------------------------------------------------
U5RXIF           EQU  H'0000'
U5TXIF           EQU  H'0001'
U5EIF            EQU  H'0002'
U5IF             EQU  H'0003'
DMA6SCNTIF       EQU  H'0004'
DMA6DCNTIF       EQU  H'0005'
DMA6ORIF         EQU  H'0006'
DMA6AIF          EQU  H'0007'


;----- PIR14 Bits -----------------------------------------------------
CLC7IF           EQU  H'0001'
C2IF             EQU  H'0002'
NCO3IF           EQU  H'0003'
DMA7SCNTIF       EQU  H'0004'
DMA7DCNTIF       EQU  H'0005'
DMA7ORIF         EQU  H'0006'
DMA7AIF          EQU  H'0007'


;----- PIR15 Bits -----------------------------------------------------
NVMIF            EQU  H'0000'
CLC8IF           EQU  H'0001'
CRCIF            EQU  H'0002'
TMR6IF           EQU  H'0003'
DMA8SCNTIF       EQU  H'0004'
DMA8DCNTIF       EQU  H'0005'
DMA8ORIF         EQU  H'0006'
DMA8AIF          EQU  H'0007'


;----- LATA Bits -----------------------------------------------------
LATA0            EQU  H'0000'
LATA1            EQU  H'0001'
LATA2            EQU  H'0002'
LATA3            EQU  H'0003'
LATA4            EQU  H'0004'
LATA5            EQU  H'0005'
LATA6            EQU  H'0006'
LATA7            EQU  H'0007'


;----- LATB Bits -----------------------------------------------------
LATB0            EQU  H'0000'
LATB1            EQU  H'0001'
LATB2            EQU  H'0002'
LATB3            EQU  H'0003'
LATB4            EQU  H'0004'
LATB5            EQU  H'0005'
LATB6            EQU  H'0006'
LATB7            EQU  H'0007'


