GreatCowBASIC/DATFileGenerator/incfiles/OrgFiles/p18F26Q83.inc
;----- CONFIG7 Options --------------------------------------------------
_BBSIZE_BBSIZE_512_7 EQU  H'FF'; Boot Block size is 512 words
_BBSIZE_BBSIZE_1024_7 EQU  H'FE'; Boot Block size is 1024 words
_BBSIZE_BBSIZE_2048_7 EQU  H'FD'; Boot Block size is 2048 words
_BBSIZE_BBSIZE_4096_7 EQU  H'FC'; Boot Block size is 4096 words
_BBSIZE_BBSIZE_8192_7 EQU  H'FB'; Boot Block size is 8192 words
_BBSIZE_BBSIZE_16384_7 EQU  H'FA'; Boot Block size is 16384 words
_BBSIZE_BBSIZE_32768_7 EQU  H'F9'; Boot Block size is 32768 words
_BBEN_OFF_7          EQU  H'FF'; Boot block disabled
_BBEN_ON_7           EQU  H'F7'; Boot block enabled
_SAFEN_OFF_7         EQU  H'FF'; SAF disabled
_SAFEN_ON_7          EQU  H'EF'; SAF enabled

;----- CONFIG8 Options --------------------------------------------------
_WRTB_OFF_8          EQU  H'FF'; Boot Block not Write protected
_WRTB_ON_8           EQU  H'FE'; Boot Block Write protected
_WRTC_OFF_8          EQU  H'FF'; Configuration registers not Write protected
_WRTC_ON_8           EQU  H'FD'; Configuration registers Write protected
_WRTD_OFF_8          EQU  H'FF'; Data EEPROM not Write protected
_WRTD_ON_8           EQU  H'FB'; Data EEPROM Write protected
_WRTSAF_OFF_8        EQU  H'FF'; SAF not Write Protected
_WRTSAF_ON_8         EQU  H'F7'; SAF Write Protected
_WRTAPP_OFF_8        EQU  H'FF'; Application Block not write protected
_WRTAPP_ON_8         EQU  H'7F'; Application Block write protected

;----- CONFIG9 Options --------------------------------------------------
_BOOTPINSEL_RA4_9    EQU  H'FC'; CRC on boot output pin is RA4
_BOOTPINSEL_RA2_9    EQU  H'FD'; CRC on boot output pin is RA2
_BOOTPINSEL_RC4_9    EQU  H'FE'; CRC on boot output pin is RC4
_BOOTPINSEL_RC5_9    EQU  H'FF'; CRC on boot output pin is RC5
_BPEN_OFF_9          EQU  H'FF'; CRC on boot output pin disabled
_BPEN_ON_9           EQU  H'EF'; CRC on boot output pin enabled, selected by BOOTPINSEL<1:0>
_ODCON_OFF_9         EQU  H'FF'; Pin drives both high-going and low-going signals
_ODCON_ON_9          EQU  H'DF'; Pin drives only low-going signals

;----- CONFIG10 Options --------------------------------------------------
_CP_OFF_10           EQU  H'FF'; PFM and Data EEPROM code protection disabled
_CP_ON_10            EQU  H'FE'; PFM and Data EEPROM code protection enabled

;----- Dumping Configs 11 and higher --------------------------------------------------


;----- End of dumping Configs --------------------------------------------------


;----- DEVID Equates --------------------------------------------------
_IDLOC0            EQU  H'200002'
_IDLOC1            EQU  H'200003'
_IDLOC2            EQU  H'200004'
_IDLOC3            EQU  H'200005'
_IDLOC4            EQU  H'200006'
_IDLOC5            EQU  H'200007'
_IDLOC6            EQU  H'200008'
_IDLOC7            EQU  H'200009'
_IDLOC8            EQU  H'20000A'
_IDLOC9            EQU  H'20000B'
_IDLOC10           EQU  H'20000C'
_IDLOC11           EQU  H'20000D'
_IDLOC12           EQU  H'20000E'
_IDLOC13           EQU  H'20000F'
_IDLOC14           EQU  H'200010'
_IDLOC15           EQU  H'200011'
_IDLOC16           EQU  H'200012'
_IDLOC17           EQU  H'200013'
_IDLOC18           EQU  H'200014'
_IDLOC19           EQU  H'200015'
_IDLOC20           EQU  H'200016'
_IDLOC21           EQU  H'200017'
_IDLOC22           EQU  H'200018'
_IDLOC23           EQU  H'200019'
_IDLOC24           EQU  H'20001A'
_IDLOC25           EQU  H'20001B'
_IDLOC26           EQU  H'20001C'
_IDLOC27           EQU  H'20001D'
_IDLOC28           EQU  H'20001E'
_IDLOC29           EQU  H'20001F'

        LIST
